Autodesk.Revit.DB.ImageTypeOptions.IsValid(Autodesk.Revit.DB.Document)
If true the ImageTypeOptions can be used to create or reload an ImageType.
Remarks:
This method returns true if all the following checks are true:
The Path points to a file that is a supported image file type. The Path points to a file that is not encrypted, which can happen for PDF files. The Path points to a file that contains the specified PageNumber.
document:
The document.
Returns:
Returns True if the options can be used to create or reload an ImageType.  False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.SetExternalResourceReference(Autodesk.Revit.DB.ExternalResourceReference)
Update the external resource reference to an image.
resourceReference:
An external resource reference to an image.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.SetPath(System.String,System.Boolean)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location.
Additionally, indicate whether the path used by ImageType should be absolute or relative.
path:
The file path that specifies the image to be used.
useRelativePath:
True if ImageType should use a relative path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.SetPath(System.String)
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location. ImageType will respectively use an absolute or relative path.
path:
The file path that specifies the image to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.#ctor(Autodesk.Revit.DB.ExternalResourceReference,Autodesk.Revit.DB.ImageTypeSource)
Constructs a new instance of the ImageTypeOptions object.
Remarks:
ImageTypeOptions uses an external resource reference to determine the local path that will be used
to open the image file. The operation to obtain the local path requires the resource to be loaded and is
performed at a later time when the local path is needed, for example, for validation. See also
LoadResource method of Autodesk.Revit.DB.IExternalResourceServer.
When the provided external resource reference contains a local file path, the information can include
an indication that the path should be treated as a relative path.
resourceReference:
An external resource reference to an image.
sourceType:
Specifies the image type source. Valid values are 'Import' and 'Link'.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ImageType source is not correct. Only Link or Import values are allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.#ctor(System.String,System.Boolean,Autodesk.Revit.DB.ImageTypeSource)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location.
This constructor saves an additional setting that indicates whether the imagetype
will be a link or an import.
path:
The file path that specifies the image to be used.
useRelativePath:
True if ImageType should use a relative path, false otherwise.
sourceType:
Specifies the image type source. Valid values are 'Import' and 'Link'.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ImageType source is not correct. Only Link or Import values are allowed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2021

Autodesk.Revit.DB.ImageTypeOptions.#ctor(System.String,System.Boolean)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location.
This constructor saves an additional setting that indicates whether the path used by ImageType
should be absolute or relative.
path:
The file path that specifies the image to be used.
useRelativePath:
True if ImageType should use a relative path, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.#ctor(System.String)
Constructs a new instance of the ImageTypeOptions object.
The provided string path must specify a local file. The path can be absolute or relative
to the project's location. ImageType will respectively use an absolute or relative path.
path:
The file path that specifies the image to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020

Autodesk.Revit.DB.ImageTypeOptions.#ctor
Constructs a new instance of the ImageTypeOptions object.
Since:
2020